src/codeigniter4-framework-9b2cd73/app/Controllers/AuthController.php

    public function signin()
    {

        $model = new UserModel(); // Instantiate the UserModel
        // check if get method is post
        if ($this->request->getMethod() === 'POST') {
            // read username and password from post data and save
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            // Validate the input is entered
            if (empty($username) || empty($password)) {
                session()->setFlashdata('error', 'Username and password are required');
                return redirect()->back();
            }

            // Search for the user in the database
            $user = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = '3'
 LIMIT 1