src/codeigniter4-framework-9b2cd73/app/Controllers/OrderController.php

SELECT *
FROM `menu`
WHERE `user_id` = '1'
---
    public function index_menu($table_identifier)
{ // this is very similar to the index_menu function in the MenuController
    // Load necessary helpers and models
    helper(['form', 'url']);
    $Menumodel = new Menu();
    $QRModel = new QRModel();

    // Get the table name or ID from the URL segment
    //$uri = service('uri');

    //$table_identifier = $uri->getSegment(3); // this uses the name table_name, but this is actually the table's ID
    // should be fixed in a future version but for now this is functional
    //$table_identifier = '1';
    // logic to get the ID for the business the table and menu belongs to
    $table_info = $QRModel->where('qr_id', $table_identifier)->first();
    // save the business' ID
    $business_id = ($table_info) ? $table_info['user_id'] : null;

    // Generate a new session ID for the order
    $order_session_id = uniqid();

    // get the menu items for this business using if foreach logic
    if ($table_info) {
        // find all menu items matching the business' user ID
        $menus = $Menumodel->where('user_id', $business_id)->findAll();

SELECT *
FROM `menu`
WHERE `user_id` = '1'
---
        }
        // now use an if loop to find menu items based on the business_id
        if ($business_info) {
            $menus = $MenuModel->where('user_id', $business_id)->findAll();

SELECT *
FROM `menu`
WHERE `menu`.`item_id` = 5
---
        $finalPrice = 0;
        foreach ($menus_with_quantities as $menuItem) {
            // Retrieve the item price from the database based on the item_id
            $itemPrice = $MenuModel->find($menuItem['item_id'])['item_price'];

INSERT INTO `orders` (`table_name`, `business_id`, `order_status`) VALUES ('2', '1', 'Active')
SELECT *
FROM `menu`
WHERE `menu`.`item_id` = 5
---
				public function place_order(){
					// helpers and models
					helper(['form', 'url']);
					$QRModel = new QRModel();
					$MenuModel = new Menu();
					$OrderModel = new OrderModel();
					$OrderItemModel = new OrderItemsModel();

					// read data from saved data/post request
					$table_id = $this->request->getPost('table_name'); // table id
					$business_info = $QRModel->where('qr_id', $table_id)->first(); // for the QR model, find table that matches this qr_id
					$business_id = ($business_info) ? $business_info['user_id'] : null; // get the business ID from their user_id
					$customer_ordering_id = uniqid(); // give customer ordering ID a unique ID. Not required, thought it would be but ran out of time to remove

					// add this data to an array for storage in the order data table
					$orderData = [
									'table_name' => $table_id, // this is actually the table's ID
									'customer_ordering_id' => $customer_ordering_id,
									'business_id' => $business_id,
									'order_status' => 'Active', // order is active not complete
					];
                    // store in the orders table in database
					$orderId = $OrderModel->insert($orderData);

					// find menu items selected with post request from the previous page
					$orderItems = [];
					foreach ($this->request->getPost('order_items') as $itemId => $quantity) {
									if ($quantity > 0) {
													// Retrieve the item price from the database based on the item ID
													$itemPrice = $MenuModel->find($itemId)['item_price'];

INSERT INTO `order_items` (`item_id`, `item_price`, `order_id`, `order_quantity`)
VALUES (5,'1.00',3,'2')
---
					}

					// Store order items in the order_items table
					$OrderItemModel->insertBatch($orderItems);

SELECT *
FROM `orders`
WHERE `business_id` = '1'
SELECT *
FROM `order_items`
WHERE `order_id` = '1'
SELECT *
FROM `menu`
WHERE `menu`.`item_id` = '2'
---
    public function index_orders() {
        // Ensure only users with user_type 'Business' can access this page
        if (session()->get('user_type') !== 'Business') {
            return redirect()->to('/home')->with('error', 'You do not have permission to access this page.');
        }

        // Load necessary models
        $OrderModel = new OrderModel();
        $OrderItemModel = new OrderItemsModel();
        $MenuModel = new Menu();

        // Get the business ID of the logged-in user
        $business_id = session()->get('user_id');
        $username = session()->get('username');
        // Fetch orders for the logged-in business
        $orders = $OrderModel->where('business_id', $business_id)->findAll();

        // Fetch items associated with each order
        foreach ($orders as &$order) {
            $order['items'] = $OrderItemModel->where('order_id', $order['order_id'])->findAll();

            // Fetch item details for each item
            foreach ($order['items'] as &$item) {
                $item_details = $MenuModel->find($item['item_id']);

SELECT *
FROM `orders`
SELECT *
FROM `order_items`
WHERE `order_id` = '1'
SELECT *
FROM `menu`
WHERE `menu`.`item_id` = '2'
---
    public function admin_index_orders() {
        // Ensure only users with user_type 'Business' can access this page
        if (session()->get('user_type') !== 'Admin') {
            return redirect()->to('/home')->with('error', 'You do not have permission to access this page.');
        }

        // Load necessary models
        $OrderModel = new OrderModel();
        $OrderItemModel = new OrderItemsModel();
        $MenuModel = new Menu();

        //$builder = $OrderModel->builder();

        //$orders = $builder->get()->getResultArray();

        // Get the business ID of the logged-in user
        //$business_id = session()->get('user_id');
        //$username = session()->get('username');
        // Fetch orders for the logged-in business
        $orders = $OrderModel->findAll();

        // Fetch items associated with each order
        foreach ($orders as &$order) {
            $order['items'] = $OrderItemModel->where('order_id', $order['order_id'])->findAll();

            // Fetch item details for each item
            foreach ($order['items'] as &$item) {
                $item_details = $MenuModel->find($item['item_id']);