src/codeigniter4-framework-9b2cd73/app/Controllers/UserController.php

SELECT *
FROM `users`
---
    public function index(){
        // Load a new user model
        $model = new \App\Models\UserModel();
        // set values based on the get request made by the webpage
        $searchField = $this->request->getGet('search_field');
        $searchValue = $this->request->getGet('search_value');
        $user_type = ''; // need a field for the user type, can be empty since it is not using a get request

        // if and else logic to determine if the search fields have data?? This doesn't seem to be used, unsure how this is working for now
        if (!empty($searchField) && !empty($searchValue)) {
            $users = $model->where($searchField, $searchValue)->findAll();
        } else{
            $users = $model->findAll();